# NumberDisplayRule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..NumberDisplayRule Property
NumberSystem Class See Also
---
The display rule of the number system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public NumberSystemDisplayRule NumberDisplayRule { get; set; }
```

Visual Basic
---
```text
Public Property NumberDisplayRule As NumberSystemDisplayRule
	Get
	Set
```

Visual C++
---
```text
public:
property NumberSystemDisplayRule NumberDisplayRule {
	NumberSystemDisplayRule get ();
	void set (NumberSystemDisplayRule value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace